# Cleaning and Working with Survey Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("survey_data.csv", index_col='ID')

In [3]:
df.head(3)

,Timestamp,Age,Country,Postal Code,Min Sib,Max Sib,TV_Amount,Muppet,Ghost_Belief,Ghost_Encounter,Rock_Paper_Scissors
ID,,,,,,,,,,,
1,6/21/2024 12:50,42,United States,60189,1,2.0,3-6 hours per week,Rizzo the Rat,Maybe,Maybe,Paper
2,6/21/2024 13:23,33,USA,59086,5,NaN,6-8 hours per week,Gonzo the Great,Maybe,No,Scissors
3,6/21/2024 13:35,52,USA,97219,0,0.0,1-3 hours per week,Beaker. A thousand times Beaker.,Maybe,Maybe,Rock

In [4]:
df.describe()

             Age     Min Sib     Max Sib
count  125.00000  125.000000  117.000000
mean    47.50400    1.504000    2.170940
std     86.84679    1.241903    1.036328
min      8.00000    0.000000    0.000000
25%     29.00000    1.000000    2.000000
50%     40.00000    1.000000    2.000000
75%     48.00000    1.000000    2.000000
max    999.00000    5.000000    4.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 125 entries, 1 to 125
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Timestamp            125 non-null    object
 1   Age                  125 non-null    int64
 2   Country              125 non-null    object
 3   Postal Code          124 non-null    object
 4   Min Sib              125 non-null    int64
 5   Max Sib              117 non-null    float64
 6   TV_Amount            125 non-null    object
 7   Muppet               125 non-null    object
 8   Ghost_Belief         124 non-null    object
 9   Ghost_Encounter      125 non-null    object
 10  Rock_Paper_Scissors  125 non-null    object
dtypes: float64(1), int64(2), object(8)
memory usage: 11.7+ KB

### Cleaning up the Country column

In [5]:
df['Country'].to_string()

'ID\n1                  United States\n2                            USA\n3                            USA\n4       United States of America\n5                 United States \n6                            USA\n7                            Usa\n8                             us\n9                            USA\n10                 United States\n11                 United States\n12                United States \n13                       Wakanda\n14                            US\n15                      America \n16                 United States\n17     United States of America \n18                United States \n19                United States \n20                           USA\n21                          USA \n22                           USA\n23                 United States\n24     United States of America \n25                           USA\n26      United States of America\n27                            US\n28                            UK\n29                           Usa\n30                           USA\n31                           USA\n32                           USA\n33                 United States\n34                           USA\n35                United States \n36                           USA\n37                           USA\n38                 United States\n39                 United States\n40                           USA\n41                United Kingdom\n42                 United Stayes\n43                           USA\n44                           USA\n45                    Australia \n46                 Untied States\n47                           USA\n48                United States \n49                           Usa\n50                            US\n51                United States \n52                 United States\n53                 United States\n54                           USA\n55                           USA\n56                 United States\n57                 United States\n58                     Australia\n59                           USA\n60                           Usa\n61                           USA\n62                           USA\n63                           USA\n64                 United States\n65                           USA\n66      United States of America\n67                           USA\n68                 United States\n69                 United States\n70                 United States\n71                United States \n72                           Usa\n73                         Italy\n74                           usa\n75                United States \n76                           USA\n77                 United States\n78                 United States\n79                 United States\n80                            US\n81                          USA \n82                           USA\n83                 United States\n84                           USA\n85                United States \n86                 United States\n87     United States of America \n88                United States \n89                           USA\n90                United States \n91                 United States\n92                United States \n93                 United States\n94                 United States\n95                          USA \n96                           USA\n97                United States \n98                           usa\n99                           USA\n100                          USA\n101                          USA\n102                United States\n103                United states\n104                           US\n105               Uunited States\n106                United States\n107                North America\n108                United States\n109                United States\n110                          USA\n111                          usa\n112                United States\n113                           US\n114                          USA\n115                          USA\n116                          USA\n117                United States\n118                United States\n119                United States\n120                United States\n121                United States\n122                United States\n123               United States \n124     United States of America\n125                United States'

In [6]:
for i in df.index:
    if 'united states' in df.loc[i, 'Country'] or 'United States' in df.loc[i, 'Country']:
        df.loc[i, 'Country'] = 'United States'
    # elif 'us' in df.loc[i, 'Country']:
    #     # df.loc[i, 'Country'] = 'United States'
    elif 'Usa' in df.loc[i, 'Country']:
        df.loc[i, 'Country'] = 'United States'
    elif 'US' in df.loc[i, 'Country']:
        df.loc[i, 'Country'] = 'United States'
    elif 'usa' in df.loc[i, 'Country']:
        df.loc[i, 'Country'] = 'United States'
    elif 'America' in df.loc[i, 'Country']:
        df.loc[i, 'Country'] = 'United States'
    elif df.loc[i, 'Country'] == 'us':
        df.loc[i, 'Country'] = 'United States'

In [7]:
df['Country'].to_string()

'ID\n1       United States\n2       United States\n3       United States\n4       United States\n5       United States\n6       United States\n7       United States\n8       United States\n9       United States\n10      United States\n11      United States\n12      United States\n13            Wakanda\n14      United States\n15      United States\n16      United States\n17      United States\n18      United States\n19      United States\n20      United States\n21      United States\n22      United States\n23      United States\n24      United States\n25      United States\n26      United States\n27      United States\n28                 UK\n29      United States\n30      United States\n31      United States\n32      United States\n33      United States\n34      United States\n35      United States\n36      United States\n37      United States\n38      United States\n39      United States\n40      United States\n41     United Kingdom\n42      United Stayes\n43      United States\n44      United States\n45         Australia \n46      Untied States\n47      United States\n48      United States\n49      United States\n50      United States\n51      United States\n52      United States\n53      United States\n54      United States\n55      United States\n56      United States\n57      United States\n58          Australia\n59      United States\n60      United States\n61      United States\n62      United States\n63      United States\n64      United States\n65      United States\n66      United States\n67      United States\n68      United States\n69      United States\n70      United States\n71      United States\n72      United States\n73              Italy\n74      United States\n75      United States\n76      United States\n77      United States\n78      United States\n79      United States\n80      United States\n81      United States\n82      United States\n83      United States\n84      United States\n85      United States\n86      United States\n87      United States\n88      United States\n89      United States\n90      United States\n91      United States\n92      United States\n93      United States\n94      United States\n95      United States\n96      United States\n97      United States\n98      United States\n99      United States\n100     United States\n101     United States\n102     United States\n103     United states\n104     United States\n105    Uunited States\n106     United States\n107     United States\n108     United States\n109     United States\n110     United States\n111     United States\n112     United States\n113     United States\n114     United States\n115     United States\n116     United States\n117     United States\n118     United States\n119     United States\n120     United States\n121     United States\n122     United States\n123     United States\n124     United States\n125     United States'

### Cleaning up the TV_Amount column

In [8]:
print((1 + 3) / 2)
print((3 + 6) / 2)
print((6 + 8) / 2)

2.0
4.5
7.0

In [9]:
for i in df.index:
    if '1-3' in df.loc[i, 'TV_Amount']:
        df.loc[i, 'TV_Amount'] = 2
    elif '3-6' in df.loc[i, 'TV_Amount']:
        df.loc[i, 'TV_Amount'] = 4.5
    elif '6-8' in df.loc[i, 'TV_Amount']:
        df.loc[i, 'TV_Amount'] = 7
    elif 'More than 8' in df.loc[i, 'TV_Amount']:
        df.loc[i, 'TV_Amount'] = 12
    elif 'Less than 1' in df.loc[i, 'TV_Amount']:
        df.loc[i, 'TV_Amount'] = .5
    else:
        df.loc[i, 'TV_Amount'] = 0

In [11]:
df.head(10)

,Timestamp,Age,Country,Postal Code,Min Sib,Max Sib,TV_Amount,Muppet,Ghost_Belief,Ghost_Encounter,Rock_Paper_Scissors
ID,,,,,,,,,,,
1,6/21/2024 12:50,42,United States,60189,1,2.0,4.5,Rizzo the Rat,Maybe,Maybe,Paper
2,6/21/2024 13:23,33,United States,59086,5,NaN,7,Gonzo the Great,Maybe,No,Scissors
3,6/21/2024 13:35,52,United States,97219,0,0.0,2,Beaker. A thousand times Beaker.,Maybe,Maybe,Rock
4,6/21/2024 13:40,65,United States,55118,5,NaN,12,Fozzie Bear,Yes,Yes,Paper
5,6/21/2024 13:50,51,United States,55116,1,2.0,12,Animal,Yes,Maybe,Rock
6,6/21/2024 14:01,28,United States,43207,1,2.0,4.5,Rizzo the Rat,Maybe,Maybe,Rock
7,6/21/2024 14:02,40,United States,53704,1,2.0,0.5,I do not have a favorite Muppet,No,No,Rock
8,6/21/2024 14:18,48,United States,54016,3,4.0,0.5,Kermit the Frog,Maybe,Yes,Rock
9,6/21/2024 14:18,51,United States,54016,1,2.0,12,Animal,Maybe,Maybe,Rock
10,6/21/2024 14:40,43,United States,54016,3,4.0,4.5,Fozzie Bear,Maybe,Maybe,Scissors

### Cleaning up the Muppet column:

In [41]:
df.head(3)

,Timestamp,Age,Country,Postal Code,Min Sib,Max Sib,TV_Amount,Muppet,Ghost_Belief,Ghost_Encounter,Rock_Paper_Scissors
ID,,,,,,,,,,,
1,6/21/2024 12:50,42,United States,60189,1,2.0,4.5,Rizzo the Rat,Maybe,Maybe,Paper
2,6/21/2024 13:23,33,United States,59086,5,NaN,7,Gonzo the Great,Maybe,No,Scissors
3,6/21/2024 13:35,52,United States,97219,0,0.0,2,Beaker. A thousand times Beaker.,Maybe,Maybe,Rock

In [52]:
# Pulling the values from Muppet column, and deduplicating to look for any cleanup from people entering data as free text

muppets = df['Muppet']
muppets.drop_duplicates()

ID
1                        Rizzo the Rat
2                      Gonzo the Great
3                               Beaker
4                          Fozzie Bear
5                               Animal
7      I do not have a favorite Muppet
8                      Kermit the Frog
12                    The Swedish Chef
15                          Miss Piggy
20                    Oscar the Grouch
22                         Mahna Mahna
108                               Pepe
124                     Cookie Monster
Name: Muppet, dtype: object

In [54]:
# Looping through Muppet column to fix the couple odd values that showed up

for i in df.index:
    if 'Beaker' in df.loc[i, 'Muppet']:
        df.loc[i, 'Muppet'] = 'Beaker'
    elif 'Cooke' in df.loc[i, 'Muppet']:
        df.loc[i, 'Muppet'] = "Cookie Monster"

df.head(3)

,Timestamp,Age,Country,Postal Code,Min Sib,Max Sib,TV_Amount,Muppet,Ghost_Belief,Ghost_Encounter,Rock_Paper_Scissors
ID,,,,,,,,,,,
1,6/21/2024 12:50,42,United States,60189,1,2.0,4.5,Rizzo the Rat,Maybe,Maybe,Paper
2,6/21/2024 13:23,33,United States,59086,5,NaN,7,Gonzo the Great,Maybe,No,Scissors
3,6/21/2024 13:35,52,United States,97219,0,0.0,2,Beaker,Maybe,Maybe,Rock

### Using `groupby` with the survey data

In [14]:
# What is the count of responses by favorite muppet?
# What are we able to determine from the count values?

fav_muppets = df.groupby(['Muppet']).count()
fav_muppets

,Timestamp,Age,Country,Postal Code,Min Sib,Max Sib,TV_Amount,Ghost_Belief,Ghost_Encounter,Rock_Paper_Scissors
Muppet,,,,,,,,,,
Animal,23,23,23,23,23,22,23,23,23,23
Beaker,3,3,3,3,3,2,3,3,3,3
Beaker. A thousand times Beaker.,1,1,1,1,1,1,1,1,1,1
Cooke Monster,1,1,1,1,1,1,1,1,1,1
Fozzie Bear,11,11,11,10,11,7,11,11,11,11
Gonzo the Great,18,18,18,18,18,17,18,18,18,18
I do not have a favorite Muppet,22,22,22,22,22,22,22,22,22,22
Kermit the Frog,23,23,23,23,23,22,23,23,23,23
Mahna Mahna,1,1,1,1,1,1,1,1,1,1
Miss Piggy,17,17,17,17,17,17,17,16,17,17
Oscar the Grouch,1,1,1,1,1,1,1,1,1,1
Pepe,1,1,1,1,1,1,1,1,1,1
Rizzo the Rat,2,2,2,2,2,2,2,2,2,2
The Swedish Chef,1,1,1,1,1,1,1,1,1,1

In [17]:
# Let's break out numeric columns from df into a new DataFrame...

df_num = df.drop(['Timestamp', 'Country', 'Postal Code', 'Ghost_Belief', 'Ghost_Encounter', 'Rock_Paper_Scissors'], axis=1)
df_num.head(3)

    Age  Min Sib  Max Sib TV_Amount                             Muppet
ID
1    42        1      2.0       4.5                      Rizzo the Rat
2    33        5      NaN         7                    Gonzo the Great
3    52        0      0.0         2  Beaker.  A thousand times Beaker.

In [20]:
# Now let's try some other aggregations with groupby, like average values (rounded to 1 decimal place)...

df_mean = df_num.groupby(['Muppet']).mean().round(1)
df_mean

                                     Age  Min Sib  Max Sib TV_Amount
Muppet
Animal                              43.9      1.2      1.9   7.76087
Beaker                              32.3      2.3      2.0       7.0
Beaker.  A thousand times Beaker.   52.0      0.0      0.0       2.0
Cooke Monster                       25.0      3.0      4.0      12.0
Fozzie Bear                        130.7      3.1      2.9  5.863636
Gonzo the Great                     39.8      1.4      2.1  7.416667
I do not have a favorite Muppet     39.5      1.5      2.5  6.272727
Kermit the Frog                     39.3      1.5      2.3  6.717391
Mahna Mahna                         13.0      3.0      4.0       2.0
Miss Piggy                          35.8      1.0      1.8  6.323529
Oscar the Grouch                    69.0      1.0      2.0       7.0
Pepe                                23.0      1.0      2.0      12.0
Rizzo the Rat                       35.0      1.0      2.0       4.5
The Swedish Chef                    42.0      1.0      2.0      12.0

In [23]:
# And how about median values?

df_med = df_num.groupby(['Muppet']).median()
df_med

                                    Age  Min Sib  Max Sib TV_Amount
Muppet
Animal                             44.0      1.0      2.0       7.0
Beaker                             36.0      1.0      2.0       7.0
Beaker.  A thousand times Beaker.  52.0      0.0      0.0       2.0
Cooke Monster                      25.0      3.0      4.0      12.0
Fozzie Bear                        43.0      3.0      4.0       4.5
Gonzo the Great                    40.0      1.0      2.0       7.0
I do not have a favorite Muppet    38.0      1.0      2.0       4.5
Kermit the Frog                    41.0      1.0      2.0       7.0
Mahna Mahna                        13.0      3.0      4.0       2.0
Miss Piggy                         32.0      1.0      2.0       4.5
Oscar the Grouch                   69.0      1.0      2.0       7.0
Pepe                               23.0      1.0      2.0      12.0
Rizzo the Rat                      35.0      1.0      2.0       4.5
The Swedish Chef                   42.0      1.0      2.0      12.0

In [25]:
# How about viewing our original data grouped by whether or not the respondent believes in ghosts?

df_ghost = df.groupby(["Ghost_Belief"]).count()
df_ghost

,Timestamp,Age,Country,Postal Code,Min Sib,Max Sib,TV_Amount,Muppet,Ghost_Encounter,Rock_Paper_Scissors
Ghost_Belief,,,,,,,,,,
Maybe,47,47,47,47,47,44,47,47,47,47
No,33,33,33,32,33,31,33,33,33,33
Yes,44,44,44,44,44,41,44,44,44,44

In [30]:
# And how about mean values of numeric data grouped by Ghost_Belief?

df_num2 = df.drop(['Timestamp', 'Country', 'Postal Code', 'Muppet', 'Ghost_Encounter', 'Rock_Paper_Scissors'], axis=1)

df_ghost_num = df_num2.groupby('Ghost_Belief').mean().round(1)
df_ghost_num

               Age  Min Sib  Max Sib TV_Amount
Ghost_Belief
Maybe         57.9      1.5      2.2  5.989362
No            43.5      1.5      2.3  7.181818
Yes           39.9      1.5      2.0  7.340909

In [31]:
# Let's sort that one by age

df_ghost_num.sort_values('Age')

               Age  Min Sib  Max Sib TV_Amount
Ghost_Belief
Yes           39.9      1.5      2.0  7.340909
No            43.5      1.5      2.3  7.181818
Maybe         57.9      1.5      2.2  5.989362